{
	"NAVBAR": {
		"MARKET": "Rynek",
		"SUBSCRIPTIONS": "Subskrypcja",
		"INSTANCES": "Instancje",
		"DOMAINS": "Domeny",
		"USERS": "Users",
		"INVENTORY": "Użytkownicy",
		"MONITOR": "Monitor",
		"CONFIGURATION": "Konfiguracja",
		"PROFILE": "Profil",
		"LOGOUT": "Wyloguj",
		"LOGIN_REGISTER": "Zaloguj się / Zarejestruj się"
	},

	"WELCOME": {
		"LOGIN": "Zaloguj Się",
  		"REGISTER": "Zarejestrować",
		"TITLE1": "Kierownictwo Sieci jak (ponieważ) Służba (serwis)",
		"TITLE2": "zaopatruje tekę użytków (podanie) kierownictwa sieci biec (przesuwać się; przesunął się; działanie; przesunięty) na na użytkownika, zapewnił (zapewniony) sieć kontrolujący system urządzeństanowiący osnowę.",
		"P1": "GEANT's *NMaaS* obsługiwać (służba; serwis) włącza trzy aspekty: zaopatrywanie, dający sobie radę (kierowniczy; zarządzający; kierowanie) i zachowujący (utrzymujący) system urządzeństanowiący osnowę *NMaaS* obsługują portalowy, platforma i dobrał (dobrany) narzędzie (obrabia), popierający (popieranie) użytkownicy w używaniu systemu, i dobierane narzędzia dla kontroli ich sieci przez *NMaaS*, jak i popierający użytkownicy które przyczyniają się (wnosić) ich program komputerowy *NMaaS* system.",
		"P2": "Użytkownicy",
		"P3": "NMaaS* użytkownicy są organizacje które nie potrzebują (chcieć) żeby posiadać *NMS* system urządzeństanowiący osnowę s& (samodzielnie) i /albo brak (potrzeba; potrzebować; chcieć) *outsource* kierownictwo sieci, jak i organizacje i /albo jednostki które szukają kierownictwa sieci jakości programu komputerowego albo kto (który) brak (potrzeba; potrzebować; chcieć) rozdzielać ich program komputerowy w obrębie wspólnoty.",
		"P4": "System, rynek i służba (serwis)",
		"P5": "NMaaS* zaopatruje wielokrotne korzyści, jak (ponieważ) system, stosowany rynek, i jak (ponieważ) służba (serwis). *NMaaS* upraszcza kierownictwo sieci dziedziny przez zaopatrywanie systemu urządzeństanowiącego osnowę i narzędzie (obrabia) przez na bazie chmura, wieledzierżawca i pewna sieć system kierownictwa. To umożliwia rozwijęciu kierownictwa sieci narzędzie (obrabia), jak i kierownictwo i kontrolujący klienta sieci, chociaż *NMaaS* nie kontroluje i kierują (dawać sobie radę) siecią z natury. wybór narzędzi które jest i /albo może jest ułatwiał dostęp do użytkowników nie jest ograniczany kierownictwem sieci narzędzie (obrabia) i może jest łatwo rozprzestrzenił (rozprzestrzeniony; przedłużył; przedłużony).",
		"P6": "Kosztować (koszt; kosztował; oceniony) skrócenie",
		"P7": "Z *NMaaS*, użytkownicy robi nie musi nieść koszty własności i ryzyk& związany z utrzymaniem i kierowanie (kontrolować; kontrolowany; kontrola) kierownictwa sieci systemu urządzeństanowiącego osnowę.",
		"P8": "Piekące ważenie (obliczanie)",
		"P9": "Jeżeli tam jest zapotrzebowanie rozprzestrzeniać Wasze usługi - wy możecie robić to w obrębie niewielu minut w wszelkim miejscu, wszelki czas, przez po prostu (dopiero co) rozwijający (rozwijanie) nowe wypadki",
		"P10": "NMaaS* Cecha (cechuje; przedstawia)",
		"P11": "Użytek (podanie; stosowany) Handlować (rynek; rynkowy; popyt)",
		"P12": "Przy zasobie (sklep) wy możecie znajdować nie tylko osoba urzędowa (oficjalny) użytki (podanie), dobierany przez administratora, ale także tam jest miejsce dla użytków (podanie) stworzonych przez wspólnotę - i rozdzielać & (oni) z innym ludzie (lud; ludowy).",
		"P13": "Oceniający (ocena; uważający) system",
		"P14": "Wy potrzebujecie (chcieć) żeby rozdzielać waszą opinię o użytku (podanie)? Dają niektóre aluzje do autora? Tam jest rozwiązanie - wy możecie oceniać i komentują każdy użytek (podanie) przy zasobie (sklep).",
		"P15": "SSO* Popierają",
		"P16": "Jeżeli wy potrzebujecie (chcieć) *login* używający (używanie; przyzwyczajający się) ten sam rachunek (wyjaśnienie; z powodu) dla niewielu usług, nie tylko *NMaasS*, Wy może *login* używający (używanie; przyzwyczajający się) *SSO*, gdzie wy możecie wybierać waszego dostawcę identyczności i *login* używający (używanie; przyzwyczajający się) istniejący (istnienie) rachunek (wyjaśnienie; z powodu; odpowiadać).",
		"P17": "Szybki (szybko) & proste rozwijęcie",
		"P18": "Wy możecie rozwijać wasz pierwszy (najpierw) użytek (podanie) w niewielu minutach - po prostu (dopiero co) dodają waszą konfigurację, otrzymują (dostawać; rozumieć) użytek (podanie) od Rynek (rynkowy; popyt) i rozwijają to - nasze usługi będzie robić odpoczywać (pozostawać; odpoczynek; reszta). W niewielu minutach wy będziecie otrzymywać (dostawać; rozumieć) adres dla waszego wypadku użytku (podanie).",
		"P19": "Proste ważenie (obliczanie)",
		"P20": "Większa ilość (bardziej; więcej) sieci, większa ilość (bardziej; więcej) dziedziny? Który jest prosty - wy łatwo możecie ważyć (obliczać) poziome użytki (podanie) przez dodawanie większa ilość (bardziej; więcej) wypadki użytku (podanie).",
		"P21": "Kierownictwo Dziedzin",
		"P22": "Wy ma bardziej (więcej) potem jedzicie dziedzina kierować (dawać sobie radę), ale wy nie macie własne system urządzeństanowiący osnowę? Tu jest prostym rozwiązaniem - *NMaaS* popierają wielokrotne dziedziny i konfiguracje kierować (dawać sobie radę).",
		"P23": "Technologie używał"
	},

	"REGISTRATION": {
		"USERNAME": "Nazwa Użytkownika",
		"PASSWORD": "Hasło",
		"CONFIRM_PASSWORD": "Potwierdź hasło",
		"EMAIL": "E-mail",
		"FIRST_NAME": "Imię",
		"LAST_NAME": "Nazwisko",
		"DOMAIN": "Domain",
		"NOT_SELECTED": "Nie zaznaczone",
		"TERMS": "Warunki korzystania",
		"AGREEMENT_MESSAGE": "zgadzam się z",
		"PRIVACY_POLICY": "Polityka prywatności",
		"SUBMIT": "Zatwierdź",
		"FORM_SUBMISSION": "Przesłanie formularza rejestracyjnego",
		"THANK_YOU_MESSAGE": "Dziękujemy za przesłanie formularza rejestracyjnego. Twoje konto musi zostać włączone przez administratora systemu. To zajmuje trochę czasu.",
		"DONE_MESASAGE": "Gotowe"
	},

	"LOGIN": {
		"USERNAME": "Nazwa użytkownika",
		"USERNAME_REQUIRED_MESSAGE": "Nazwa użytkownika jest wymagana",
		"PASSWORD": "Hasło",
		"PASSWORD_REQUIRED_MESSAGE": "Wymagane jest hasło",
  		"LOGIN": "Zaloguj Się",
  		"LOGIN_WITH": "Zaloguj się z"
	}
}